prst/TMS320F28xxx/n5110.c
/* ************************************************************************** */
/*
 * Описание     : Это драйвер для графического LCD от Nokia 5110, а также его китайских клонов.
 * Автор        : Xander Gresolio <xugres@gmail.com>
 * Веб-страница : https://github.com/gresolio/N3310Lib
 * Лицензия     : GPL v3.0
 * Оптимизация  : kobzar aka kobraz для http://cxem.net/ maodzedun@gmail.com
 */
/* ************************************************************************** */

/* ************************************************************************** */
#include <string.h>
#include <stdlib.h>
#include <stdio.h>
#include "init.h"

#if (1==__AVR__)
#include <avr/interrupt.h>
#include "n5110.h"
#endif //(1==__AVR__)

#if (1==__TMS320__)
#include "n5110.h"
//#include "F2802x_Device.h"
#include "include/F2802x_Device.h"     // DSP2802x Headerfile Include File
#endif //(1==__TMS320__)

/* ************************************************************************** */


/* ************************************************************************** */
// Прототипы приватных функций драйвера
/* ************************************************************************** */
static void LcdSend    ( byte data, LcdCmdData cd );
static void Delay      ( void );
/* ************************************************************************** */


/* ************************************************************************** */
// Глобальные переменные
/* ************************************************************************** */
// Кэш в ОЗУ 84*48 бит или 504 байта
static byte  LcdCache [ LCD_CACHE_SIZE ];
/* ************************************************************************** */


/* ************************************************************************** */
// Чтобы не обновлять весь дисплей, а лишь ту часть что изменилась,
// будем отмечать две границы кэша где произошли изменения. Затем
// можно копировать эту часть кэша между границами в ОЗУ дисплея.
/* ************************************************************************** */
static int   LoWaterMark;   // нижняя граница
static int   HiWaterMark;   // верхняя граница
/* ************************************************************************** */


/* ************************************************************************** */
// Указатель для работы с LcdCache[]
/* ************************************************************************** */
static int   LcdCacheIdx;
/* ************************************************************************** */


/* ************************************************************************** */
// Флаг изменений кэша
/* ************************************************************************** */
static byte  UpdateLcd;
/* ************************************************************************** */



/* ************************************************************************** */
/*
 * Имя                   : Lcd_init
 * Описание              : Производит инициализацию порта и SPI МК, контроллера LCD
 * Аргумент(ы)           : Нет
 * Возвращаемое значение : Нет
 */
/* ************************************************************************** */
void Lcd_init ( void ) {
#if (1==__AVR__)
    // Pull-up на вывод подключенный к reset дисплея
    LCD_PORT |= _BV ( LCD_RST_PIN );

    // Устанавливаем нужные биты порта на выход
    LCD_DDR |= _BV( LCD_RST_PIN ) | _BV( LCD_DC_PIN ) | _BV( LCD_CE_PIN ) | _BV( SPI_MOSI_PIN ) | _BV( SPI_CLK_PIN );

    // Некалиброванная задержка
    Delay();

    // Дергаем reset
    LCD_PORT &= ~( _BV( LCD_RST_PIN ) );
    Delay();
    LCD_PORT |= _BV ( LCD_RST_PIN );

    // Активируем SPI:
    // без прерываний, старший бит первый, режим мастера, CPOL->0, CPHA->0, Clk/4
    SPCR = 0x50;

    // Отключаем LCD контроллер - высокий уровень на SCE
    LCD_PORT |= _BV( LCD_CE_PIN );

    // Отправляем команды дисплею
    LcdSend ( 0x21, LCD_CMD ); // Включаем расширенный набор команд (LCD Extended Commands)
    LcdSend ( 0xC8, LCD_CMD ); // Установка контрастности (LCD Vop)
    LcdSend ( 0x06, LCD_CMD ); // Установка температурного коэффициента (Temp coefficent)
    LcdSend ( 0x13, LCD_CMD ); // Настройка питания (LCD bias mode 1:48)
    LcdSend ( 0x20, LCD_CMD ); // Включаем стандартный набор команд и горизонтальную адресацию (LCD Standard Commands,Horizontal addressing mode)
    LcdSend ( 0x0C, LCD_CMD ); // Нормальный режим (LCD in normal mode)

    // Первичная очистка дисплея
    Lcd_clear();
    Lcd_update();
#endif //(1==__AVR__)

#if (1==__TMS320__)
    rst_l;           // Reset (2) 0 OXFD = 11111101
    DELAY(10);       // задержка 5us
    rst_h;           // Reset (2) 1

    ce_l;            // чип включить (3) 0, открытая 0xFB = 11111011
    DELAY(0);        // задержка 5us
    ce_h;            // чип рядом

    // Отправляем команды дисплею
    // ........................................................................
    // Включаем расширенный набор команд (LCD Extended Commands)
    // создание команд
    write_com(0x21);

    // Установка контрастности (LCD Vop)
    // 0xC8 = 11001000
    write_com(0xc8);

    // Установка температурного коэффициента (Temp coefficent)
    // 0x06 = 00000110
    write_com(0x06);

    // Настройка питания (LCD bias mode 1:48)
    // 0x13 = 00010011
    write_com(0x13);

    // Включаем стандартный набор команд и горизонтальную адресацию
    // (LCD Standard Commands,Horizontal addressing mode)
    // основной набор команд.
    write_com(0x20);

    // Нормальный режим (LCD in normal mode)
    // Обычный режим 0x0c = 00001100
    write_com(0x0c);
    // ........................................................................

    lcd_clear();

    ce_l;            // чип позволит 0xFB = 11111011
#endif //(1==__TMS320__)
}
/* ************************************************************************** */


/* ************************************************************************** */
/*
 * Имя                   :  Lcd_clear
 * Описание              :  Очищает дисплей. Далее необходимо выполнить LcdUpdate
 * Аргумент(ы)           :  Нет
 * Возвращаемое значение :  Нет
 */
/* ************************************************************************** */
void Lcd_clear ( void ) {
    memset ( LcdCache,  0x00,  LCD_CACHE_SIZE );
    
    // Сброс указателей границ в максимальное значение
    LoWaterMark = 0;
    HiWaterMark = LCD_CACHE_SIZE - 1;

    // Установка флага изменений кэша
    UpdateLcd = TRUE;
}
/* ************************************************************************** */



/* ************************************************************************** */
/*
 * Имя                   : Lcd_update
 * Описание              : Копирует кэш в ОЗУ дисплея
 * Аргумент(ы)           : Нет
 * Возвращаемое значение : Нет
 */
/* ************************************************************************** */
void Lcd_update (void) {
    int i;

    if ( LoWaterMark < 0 )
        LoWaterMark = 0;
    else if ( LoWaterMark >= LCD_CACHE_SIZE )
        LoWaterMark = LCD_CACHE_SIZE - 1;

    if ( HiWaterMark < 0 )
        HiWaterMark = 0;
    else if ( HiWaterMark >= LCD_CACHE_SIZE )
        HiWaterMark = LCD_CACHE_SIZE - 1;

    #ifdef CHINA_LCD  // Алгоритм для китайского ЖК из нестандартным контроллером

        byte x,y;

