prst/TMS320F28xxx/n5110.c
    if ( (ch >= 0x20) && (ch <= 0x7F) ) {
        // Смещение в таблице для символов ASCII[0x20-0x7F]
        ch -= 32;
    } else if ( ch >= 0xC0 ) {
        // Смещение в таблице для символов CP1251[0xC0-0xFF]
        ch -= 96;
    } else {
        // Остальные игнорируем (их просто нет в таблице для экономии памяти)
        ch = 95;
    }

    if ( size == FONT_1X ) {
        for ( i = 0; i < 5; i++ ) {
            // Копируем вид символа из таблицы в кэш
            LcdCache[LcdCacheIdx++] = pgm_read_byte( &(FontLookup[ch][i]) ) << 1;
        }
    } else if ( size == FONT_2X ) {
        tmpIdx = LcdCacheIdx - 84;

        if ( tmpIdx < LoWaterMark ) {
            LoWaterMark = tmpIdx;
        }

        if ( tmpIdx < 0 )  return OUT_OF_BORDER;

        for ( i = 0; i < 5; i++ ) {
            // Копируем вид символа из таблицы у временную переменную
            c = pgm_read_byte(&(FontLookup[ch][i])) << 1;
            // Увеличиваем картинку
            // Первую часть
            b1 =  (c & 0x01) * 3;
            b1 |= (c & 0x02) * 6;
            b1 |= (c & 0x04) * 12;
            b1 |= (c & 0x08) * 24;

            c >>= 4;
            // Вторую часть
            b2 =  (c & 0x01) * 3;
            b2 |= (c & 0x02) * 6;
            b2 |= (c & 0x04) * 12;
            b2 |= (c & 0x08) * 24;

            // Копируем две части в кэш
            LcdCache[tmpIdx++] = b1;
            LcdCache[tmpIdx++] = b1;
            LcdCache[tmpIdx + 82] = b2;
            LcdCache[tmpIdx + 83] = b2;
        }

        // Обновляем x координату курсора
        LcdCacheIdx = (LcdCacheIdx + 11) % LCD_CACHE_SIZE;
    }

    if ( LcdCacheIdx > HiWaterMark ) {
        // Обновляем верхнюю границу
        HiWaterMark = LcdCacheIdx;
    }

    // Горизонтальный разрыв между символами
    LcdCache[LcdCacheIdx] = 0x00;

    // Если достигли позицию указателя LCD_CACHE_SIZE - 1, переходим в начало
    if(LcdCacheIdx == (LCD_CACHE_SIZE - 1) ) {
        LcdCacheIdx = 0;
        return OK_WITH_WRAP;
    }

    // Иначе просто инкрементируем указатель
    LcdCacheIdx++;
    return OK;
}


/* ************************************************************************** */
/*
 * Имя                   : Lcd_print
 * Описание              : Эта функция предназначена для печати строки из переменной
 * Аргумент(ы)           : size      -> размер шрифта. Смотри enum в n5110.h
 *                       : dataArray -> массив содержащий строку которую нужно напечатать
 *						 : x,y -> координаты
 * Возвращаемое значение : смотри возвращаемое значение в n5110lcd.h
 * Пример                : LcdFStr(0, 0, FONT_1X,(unsigned char*)some_char);
 *                         LcdFStr(0, 0, FONT_1X, &name_of_string_as_array);
 */
/* ************************************************************************** */
byte Lcd_print ( byte x, byte y, LcdFontSize size, byte dataArray[] ) {
	LcdGotoXY(x,y);
    byte tmpIdx=0;
    byte response;
    while( dataArray[ tmpIdx ] != '\0' ) {
        // Выводим символ
        response = LcdChr( size, dataArray[ tmpIdx ] );

        // Не стоит волноваться если произойдет OUT_OF_BORDER,
        // строка будет печататься дальше из начала дисплея
        if( response == OUT_OF_BORDER)  return OUT_OF_BORDER;

        // Увеличиваем указатель
        tmpIdx++;
    }
    return OK;
}
/* ************************************************************************** */



/* ************************************************************************** */
/*
 * Имя                   : Lcd_prints
 * Описание              : Эта функция предназначена для печати статичной строки
 * Аргумент(ы)           : size    -> размер шрифта. Смотри enum в n5110.h
 *                         dataPtr -> указатель на строку которую нужно напечатать
 *						 : x,y -> координаты
 * Возвращаемое значение : смотри возвращаемое значение в n5110lcd.h
 * Пример                : LcdFStr(0, 0, FONT_1X, PSTR("Hello World"));
 *                         LcdFStr(0, 0, FONT_1X, &name_of_string_as_array);
 */
/* ************************************************************************** */
byte Lcd_prints ( byte x, byte y, LcdFontSize size, const byte *dataPtr ) {
    LcdGotoXY(x,y);

	byte c;
    byte response;

    //for ( c = pgm_read_byte(dataPtr); c; ++dataPtr, c=pgm_read_byte(dataPtr) )
    for ( c = pgm_read_byte(dataPtr); c; ++dataPtr, c=pgm_read_byte(dataPtr) )
    {
        // Выводим символ
        response = LcdChr( size, c );
        if ( response == OUT_OF_BORDER )   return OUT_OF_BORDER;
    }

    return OK;
}
/* ************************************************************************** */


/* ************************************************************************** */
/*
 * Имя                   : Lcd_printf
 * Описание              : Эта функция предназначена для печати числа с плавающей запятой
 * Аргумент(ы)           : size      -> размер шрифта. Смотри enum в n5110.h
 *                       : data -> число
 *						 : accuracy -> число знаков после запятой
 *						 : x,y -> координаты
 * Возвращаемое значение : смотри возвращаемое значение в n5110lcd.h
 * Пример                : LcdFStr(0, 0, FONT_1X, float_var , 2);
 *                         LcdFStr(0, 0, FONT_1X, &name_of_string_as_array);
 */
/* ************************************************************************** */
void Lcd_printf ( byte x, byte y, LcdFontSize size, float data, int accuracy ) {
	Lcd_print ( x, y, size, (unsigned char*)gftoa(data, accuracy) );
}
/* ************************************************************************** */


/* ************************************************************************** */
/*
 * Имя                   : Lcd_pixel
 * Описание              : Отображает пиксель по абсолютным координатам (x,y)
 * Аргумент(ы)           : x,y  -> абсолютные координаты пикселя
 *                         mode -> Off, On или Xor. Смотри enum в n5110.h
 * Возвращаемое значение : смотри возвращаемое значение в n5110lcd.h
 */
/* ************************************************************************** */
byte Lcd_pixel ( byte x, byte y, LcdPixelMode mode ) {
    int  index;
    byte  offset;
    byte  data;

    // Защита от выхода за пределы
    if ( x >= LCD_X_RES || y >= LCD_Y_RES) return OUT_OF_BORDER;

    // Пересчет индекса и смещения
    index = ( ( y / 8 ) * 84 ) + x;
    offset  = y - ( ( y / 8 ) * 8 );

    data = LcdCache[ index ];

    // Обработка битов

